Config/InformationRegisters/СтатусыКонтрагентовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусУчастника</Name>
					<Comment>0 - не определено, 1 - участник, 2 - не участник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СтатусыКонтрагентовИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак участия контрагента в системе маркировки по определенной группе товаров
// по данным пользователя и ИСМП
//
// Параметры:
//  <Контрагент>  - <СправочникСсылка.Контрагенты> - проверяемый контрагент
//  <ВидыМаркируемойПродукции>  - <Массив> - список проверяемых видов продукции
//
// Возвращаемое значение:
//   <Булево, Неопределено>   - ИСТИНА - контрагент является участником
//            ЛОЖЬ - не является участником
//            НЕОПРЕДЕЛЕНО - не удалось определить статус участника
//
Функция УчастникСистемыМаркировки(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(СтатусыКонтрагентовИСМП.СтатусУчастника = 1) КАК СтатусУчастника
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентовИСМП КАК СтатусыКонтрагентовИСМП
	|ГДЕ
	|	СтатусыКонтрагентовИСМП.Контрагент = &Контрагент";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЭтоУчастникСистемыМаркировки = Истина;
	Если Выборка.Следующий() Тогда
		ЭтоУчастникСистемыМаркировки = (Выборка.СтатусУчастника = ИСТИНА);
	КонецЕсли;
	
	Возврат ЭтоУчастникСистемыМаркировки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
